stresstest.yml
config:
  processor: './stresstest.js'
  target: 'http://localhost:4000'
  phases:
    - duration: 180
      arrivalRate: 1
      name: '1 user for 3 minutes / warm up the application'
    # - pause: 30
    # - duration: 180
    #   arrivalRate: 1
    #   rampTo: 10
    #   name: '10 users for 3 minutes'
    # - duration: 180
    #   arrivalRate: 10
    #   rampTo: 100
    #   name: '100 users for 3 minutes'
scenarios:
  - name: 'Get suggested'
    flow:
      - function: 'getRandomPage'
      - get:
        url: /products/{{id}}
      - log: 'Current page is set to: {{id}}'